Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencyAssocProp Property
 There is a circular dependency between a Line created with Pick Support and the supporting member.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencyAssocProp { get; }
Public Shared ReadOnly Property CircularDependencyAssocProp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencyAssocProp {
	FailureDefinitionId^ get ();
}
static member CircularDependencyAssocProp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace